spec/cassettes/create_Payment_on_Successful_charge/creates_the_reference_id_for_the_payment.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_18JiNYBDRuCwc6R2cAyZA6DY
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.36.0
      Authorization:
      - Bearer sk_test_7Z032KY6RwNK0xgooEKxqYYO
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.36.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Logan-Houstons-MacBook-Pro.local 15.5.0 Darwin Kernel Version 15.5.0: Tue
        Apr 19 18:36:36 PDT 2016; root:xnu-3248.50.21~8/RELEASE_X86_64 x86_64","hostname":"Logan-Houstons-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 07 Jun 2016 11:31:02 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2020'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8auEp0bpfLTdft
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_18JiNYBDRuCwc6R2cAyZA6DY",
          "object": "event",
          "api_version": "2015-10-16",
          "created": 1465298896,
          "data": {
            "object": {
              "id": "ch_18JiNYBDRuCwc6R26vZQNz18",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application_fee": null,
              "balance_transaction": "txn_18JiNYBDRuCwc6R2UB2MNmjv",
              "captured": true,
              "created": 1465298896,
              "currency": "cad",
              "customer": "cus_8Z2JOTzC6WSeet",
              "description": "Charge successful",
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": null,
              "livemode": false,
              "metadata": {},
              "order": null,
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_18JiNYBDRuCwc6R26vZQNz18/refunds"
              },
              "shipping": null,
              "source": {
                "id": "card_18JiN1BDRuCwc6R2elyDunEF",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_8Z2JOTzC6WSeet",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 6,
                "exp_year": 2017,
                "fingerprint": "SAow76ubNBhomPEk",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "succeeded"
            }
          },
          "livemode": false,
          "pending_webhooks": 1,
          "request": "req_8auBEdKESjzn3e",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Tue, 07 Jun 2016 11:31:02 GMT
recorded_with: VCR 3.0.1
